const router=require('express').Router();

//----------------------------------------

const {
    Login      // פונקציית התחברות 
}=require('../controller/login'); // נתיב בו נמצאת הפונקציה שלי

//------- ניתוב להתחברות ------- POST
// במידה ובניתוב יש /login
// אני מפעיל את הפונקציה Login                                            פעולת POST
router.post('',Login); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/login
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה