const router=require('express').Router();

//--------------------------------------

const {
    Private      // פונקציית שמראה תוכן למשתמש מחובר
}=require('../controller/private'); // נתיב בו נמצאת הפונקציה שלי

//------- ניתוב לשליחת בקשה ------- GET
// במידה ובניתוב יש /private
// אני מפעיל את הפונקציה Private                                           פעולת GET
router.get('',Private); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/private
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה